# ====================================
# USERS.PY CONST
# ====================================

USERS_HEADERS = [
    "ID", "Username", "Участие в квесте", "РТ СТАНЦИЯ", "ЛФИ СТАНЦИЯ",
    "ФАКТ СТАНЦИЯ", "ФЭФМ СТАНЦИЯ", "ФПМИ СТАНЦИЯ", "ФБМФ СТАНЦИЯ",
    "КНТ СТАНЦИЯ", "ФБВТ СТАНЦИЯ", "ВШПИ СТАНЦИЯ", "ВШМ СТАНЦИЯ",
    "ПИШ ФАЛТ СТАНЦИЯ", "Количество пройденных станций",
    "Квест сумма баллов", "Квиз", "1", "2", "3", "4", "5"
]

USERS_HEADER_COLOR = "4F81BD"
USERS_TITLE = "Пользователи"
USERS_FILL_TYPE = "solid"
USERS_HEADER_FONT_COLOR = "FFFFFF"
USERS_FILENAME = "users.xlsx"

# ====================================
# ADMIN.PY CONST
# ====================================

ADMIN_TITLE = ["Username", "Level", "Station"]
ADMIN_FILENAME = "admins.xlsx"

# ====================================
# HANDLERS.PY CONST
# ====================================

STATIONS = {
    "станция ФРКТ": 1,
    "станция ЛФИ": 2,
    "станция ФАКТ": 3,
    "станция ФЭФМ": 4,
    "станция ФПМИ": 5,
    "станция ФБМФ": 6,
    "станция КНТ": 7,
    "станция ФБВТ": 8,
    "станция ВШПИ": 9,
    "станция ВШМ": 10,
    "станция ПИШ ФАЛТ": 11
}

STATION_PLACE = [
    "Физтех.Цифра 3 этаж",
    "Лабораторный корпус",
    "Физтех.Арктика 2 этаж",
    "Физтех.Арктика 3 этаж",
    "Главный корпус 1 этаж",
    "Физтех.Цифра 4 этаж",
    "Физтех.Цифра 2 этаж",
    "Главный корпус 1 этаж",
    "Главный корпус 2 этаж",
    "Главный корпус 1 этаж",
    "Физтех.Арктика 4 этаж"
]

SCHOOLS = {
    "ФРКТ": 1,
    "ЛФИ": 2,
    "ФАКТ": 3,
    "ФЭФМ": 4,
    "ФПМИ": 5,
    "ФБМФ": 6,
    "КНТ": 7,
    "ФБВТ": 8,
    "ВШПИ": 9,
    "ВШМ": 10,
    "ПИШ ФАЛТ": 11
}

QUEST_TEXT = (
    "🎉 Вам предстоит увлекательное путешествие по стендам всех Физтех-школ! "
    "Выполняйте задания и получайте баллы.\n\n"
    "📈 За каждое выполненное задание от Физтех-школы вы сможете получить "
    "от 1 до 2 баллов.\n\n"
    "🎁 Самые активные участники получат крутые призы…"
)

# ====================================
# MERCH_HANDLERS.PY CONST
# ====================================
QUIZ_LIST = {
    "Квиз 1": 1,
    "Квиз 2": 2,
    "Квиз 3": 3,
    "Квиз 4": 4,
    "Квиз 5": 5,
}

DEFAULT_MERCH_PRICES = [
    ("Раскрасить шоппер", 5),
    ("Шоппер", 6),
    ("Раскрасить футболку", 7),
    ("Футболка", 8),
    ("Пауэрбанк", 15),
]

# ====================================
# MERCH.PY CONST
# ====================================

MERCH_HEADER_COLOR = "4F81BD"
MERCH_HEADER_FONT_COLOR = "FFFFFF"
MERCH_HEADER_NAME = "header"
MERCH_BORDER_STYLE = "thin"
MERCH_FILENAME = "merch.xlsx"

MERCH_TYPES = [
    "Раскрасить шоппер",
    "Шоппер",
    "Раскрасить футболку",
    "Футболка",
    "Пауэрбанк",
]

# ====================================
# QUIZ.PY CONST
# ====================================
VALID_WORDS = {"сосиска": 1, "колбаса": 2, "1": 3, "2": 4, "3": 5}

DEFAULT_QUIZEZ = [
    ("История мфти", "11:00", "2.36 Физтех.Цифра"),
    ("Физтех шутят", "12:00", "2.36 Физтех.Цифра"),
    ("Физика не для слабонервных", "13:00", "2.36 Физтех.Цифра"),
    ("Математика не для слабонервных", "14:00", "2.36 Физтех.Цифра"),
    ("Квиз 5", "15:00", "305 ЛК"),
]

DOCX_PATH = "Квизы.docx"


WEBHOOK_URL = "https://fest.mipt.ru/your-webhook-path"
WEB_SERVER_HOST = "0.0.0.0"
WEB_SERVER_PORT = 10181
